classes/classes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-13 Thu 20:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Campaign Classes</title>
<meta name="author" content="zfoteff" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/stylesheets/default-style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Campaign Classes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org05dd8b8">1. Bard</a></li>
<li><a href="#orgc6988d9">2. Druid</a></li>
<li><a href="#org091131f">3. Wizard</a></li>
<li><a href="#org2550277">4. Monk</a></li>
<li><a href="#org007bf26">5. Sorcerer</a></li>
<li><a href="#orgc5cc570">6. Prophet</a></li>
<li><a href="#org38a7e7e">7. Merchant</a></li>
<li><a href="#org5ea54e4">8. Warrior</a></li>
<li><a href="#org3cc2de7">9. Rogue</a></li>
</ul>
</div>
</div>
<div class="org-center">
<p>
[<a href="../dnd.html#ID-DND">Main Menu</a>]
</p>
</div>
<hr />
<div id="outline-container-org05dd8b8" class="outline-2">
<h2 id="org05dd8b8"><span class="section-number-2">1.</span> <a href="bard.html#ID-8bb9a08a-97c0-4231-a002-ad7dcf83e4d8">Bard</a></h2>
<div class="outline-text-2" id="text-1">
<p>
Support the rest of the party using your talents, or your &ldquo;talents&rdquo;. Uses unique class abilities and spells
</p>
</div>
</div>
<div id="outline-container-orgc6988d9" class="outline-2">
<h2 id="orgc6988d9"><span class="section-number-2">2.</span> Druid</h2>
<div class="outline-text-2" id="text-2">
<p>
Work with the forces of nature to pursue your goals. Use alchemy primarily, cast using Charisma
</p>
</div>
</div>
<div id="outline-container-org091131f" class="outline-2">
<h2 id="org091131f"><span class="section-number-2">3.</span> <a href="wizard.html#ID-3e1b93b3-f1ad-4148-bb16-5313b376a707">Wizard</a></h2>
<div class="outline-text-2" id="text-3">
<p>
Become a powerful channel of the magical elements. Use spells primarily, cast using the character&rsquo;s <b>Intelligence</b> stat.
</p>
</div>
</div>
<div id="outline-container-org2550277" class="outline-2">
<h2 id="org2550277"><span class="section-number-2">4.</span> Monk</h2>
<div class="outline-text-2" id="text-4">
<p>
Trust only in a higher power(s?) to achieve your goals. Uses weapons and unarmed strikes primarily.
</p>
</div>
</div>
<div id="outline-container-org007bf26" class="outline-2">
<h2 id="org007bf26"><span class="section-number-2">5.</span> Sorcerer</h2>
<div class="outline-text-2" id="text-5">
<p>
Manipulate the world around you in a manner of your choosing. Uses spells primarily, cast using Wisdom.
</p>
</div>
</div>
<div id="outline-container-orgc5cc570" class="outline-2">
<h2 id="orgc5cc570"><span class="section-number-2">6.</span> Prophet</h2>
<div class="outline-text-2" id="text-6">
<p>
Chosen vessel of a particular God. Prophets do not know which God they channel at the beginning of the game. The prophet has a primary mission of discovering which God they are aligned to by learning about the religious system of the world.
</p>
</div>
</div>
<div id="outline-container-org38a7e7e" class="outline-2">
<h2 id="org38a7e7e"><span class="section-number-2">7.</span> Merchant</h2>
<div class="outline-text-2" id="text-7">
<p>
Buy low, sell high! Focus on acquiring as much money as possible; making trades and building a reputation across the cities of the world.
</p>
</div>
</div>
<div id="outline-container-org5ea54e4" class="outline-2">
<h2 id="org5ea54e4"><span class="section-number-2">8.</span> Warrior</h2>
<div class="outline-text-2" id="text-8">
<p>
Hack, slash, pummel, and dominate your enemies on the way to victory. Uses weapons primarily.
</p>
</div>
</div>
<div id="outline-container-org3cc2de7" class="outline-2">
<h2 id="org3cc2de7"><span class="section-number-2">9.</span> <a href="rogue.html#ID-7e784143-655d-4170-af49-68aceea59caa">Rogue</a></h2>
<div class="outline-text-2" id="text-9">
<hr />
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-07-03 Mon 00:00</p>
<p class="author">Author: zfoteff</p>
<p class="date">Created: 2023-07-13 Thu 20:05</p>
</div>
</body>
</html>
